Revit 2027 API
Railing.Create Method
Overload List
Name | Description
Create(Document, CurveLoop, ElementId, ElementId) |  Creates a new railing by specifying the railing path in the project document.
Create(Document, ElementId, ElementId, RailingPlacementPosition) |  Automatically creates new railings with the specified railing type on all sides of a stairs or ramp element.
Create(Document, ElementId, ElementId, ElementId, RailingPlacementPosition) |  Creates new railings with the specified railing type on all sides of a stairs instance in a MultistoryStairs element.
Top
See Also
Reference
Railing Class
Autodesk.Revit.DB.Architecture Namespace